Mikhail-Za/trail-mate-T-display-p4-/builds/esp_idf/targets/tdisplayp4_tft/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_ESPTOOLPY_FLASHFREQ_120M=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_TINYUSB_MSC_ENABLED=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_TASK_WDT_TIMEOUT_S=20
# Trail-mate runs as a guest app inside the DualMesh launcher's partition table,
# which has no coredump partition -> flash coredump spammed "No core dump partition
# found!" every boot and could never work here. Dump over UART instead (works without
# a partition; a crash prints a decodable ELF dump on the console).
CONFIG_ESP_COREDUMP_ENABLE_TO_UART=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_TRAIL_MATE_T_DISPLAY_P4_PANEL_HI8561=y
CONFIG_TRAIL_MATE_T_DISPLAY_P4_PIXEL_FORMAT_RGB565=y
CONFIG_TRAIL_MATE_T_DISPLAY_P4_LVGL_BUFFER_LINES=80
# LVGL heap: the default 64KB builtin pool is exhausted by the 34-row Chat settings
# page (8 channel slots x enable/name/key). When full, lv_malloc_zeroed() for the
# focus style-transition returns NULL and LVGL writes through it unchecked -> store
# fault at 0x0 on Settings->Chat. Triple the pool; it lives in internal RAM and there
# is ~440KB of free internal heap, so this leaves ample headroom.
# NOTE: INERT while CONFIG_LV_USE_CLIB_MALLOC=y (bottom of this file) routes lv_malloc
# to the IDF heap -- the builtin pool this sizes is not compiled then. Kept only as the
# correct fallback sizing if the clib allocator is ever switched off again.
CONFIG_LV_MEM_SIZE_KILOBYTES=192
# The P4 camera-cutout header is tall, so the top-bar controls scale up to fill the
# band below the lens. Only montserrat 14 is compiled by default, so every larger
# font macro fell back to 14px and the header text never grew. Compile in 20 + 24 so
# the back button, title and battery render at their intended larger size.
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
# ES8311 audio codec (esp_codec_dev): compile in the ES8311 driver so
# es8311_codec_new is available for the P4 PTT/audio subsystem.
CONFIG_CODEC_ES8311_SUPPORT=y
# ChaCha20-Poly1305 + SHA-256 for team-mode AEAD (IdfTeamCrypto). These three
# mbedtls modules default to OFF in ESP-IDF's Kconfig; the team protocol's
# authenticated key distribution / encrypted mgmt frames need them, and they
# must be byte-compatible with the rweather/Crypto peers on the Arduino nodes.
# ChaChaPoly depends on both Chacha20 and Poly1305.
CONFIG_MBEDTLS_CHACHA20_C=y
CONFIG_MBEDTLS_POLY1305_C=y
CONFIG_MBEDTLS_CHACHAPOLY_C=y
# Offline map tiles: LVGL filesystem driver. The map tile loader opens each tile via
# lv_fs_open("A:/maps/base/osm/{z}/{x}/{y}.png"), but the IDF build registered NO LVGL
# filesystem driver for drive 'A' -- that driver only existed in the Arduino-only
# LV_Helper, which this firmware does not compile. Every tile open therefore returned
# "unknown driver letter" and the map drew a blank placeholder, even though the tiles
# are present on the card. Enable LVGL's built-in POSIX FS backend and map drive 'A' to
# the SD mount at /sdcard: lv_fs strips the "A:" prefix and the POSIX driver prepends
# LV_FS_POSIX_PATH, so "A:/maps/..." resolves to "/sdcard/maps/..." (LV_FS_POSIX_LETTER
# 65 = ASCII 'A'). LVGL auto-registers the driver from lv_init() -> lv_fs_posix_init().
CONFIG_LV_USE_FS_POSIX=y
CONFIG_LV_FS_POSIX_LETTER=65
CONFIG_LV_FS_POSIX_PATH="/sdcard"
# Offline map tiles part 2: PNG decoder + PSRAM-backed allocator. With the FS driver
# above the tile files now open, but two pieces were still missing and the map drew
# blank/white:
#  1) No PNG decoder was compiled in, so the decoded tile produced no pixels. Enable
#     LVGL's built-in lodepng decoder; lv_init() auto-registers it (lv_lodepng_init()),
#     and the tile loader decodes through lv_image_decoder_open() (map_tiles.cpp).
#  2) A decoded 256x256 tile is ~256KB, but LVGL's built-in allocator pool is only 192KB
#     of INTERNAL RAM, so the lodepng decode buffer AND the tile RAM cache (lv_malloc in
#     map_tiles.cpp) would both fail. Switch LVGL to the C-library allocator so lv_malloc
#     maps to the ESP-IDF heap; with SPIRAM_USE_MALLOC + MALLOC_ALWAYSINTERNAL=16384 any
#     allocation >=16KB (every tile) goes to PSRAM, which has ample room. This makes the
#     earlier CONFIG_LV_MEM_SIZE_KILOBYTES=192 (builtin-pool only) moot.
CONFIG_LV_USE_LODEPNG=y
CONFIG_LV_USE_CLIB_MALLOC=y
# JPEG decoder (TJPGD, auto-registered by lv_init like lodepng): decodes the Field
# Guide's plant photos (A:/guides/photos/**, baseline JPEG, pre-sized to 500px wide)
# and, as a side effect, makes the Satellite tile layer (.jpg) decodable -- the
# decoder-aware map_source_directory_available gate un-gates it automatically if
# satellite tiles are ever loaded onto the card.
CONFIG_LV_USE_TJPGD=y
# Offline Translate app: Arabic needs glyph shaping + right-to-left layout. BIDI is
# label-level and inert for LTR text; the Arabic/Persian pass only touches strings
# containing those codepoints. Fonts themselves load from the SD card (binfont).
CONFIG_LV_USE_BIDI=y
CONFIG_LV_USE_ARABIC_PERSIAN_CHARS=y
# Pin the two heap options the CLIB-malloc routing above DEPENDS on. Both currently
# match ESP-IDF defaults, but nothing guaranteed that: an IDF bump or a heap-tuning
# edit (e.g. switching to SPIRAM_USE_CAPS_ALLOC) would silently break the "every
# >=16KB tile allocation lands in PSRAM" assumption and exhaust internal RAM at
# map-open through LVGL's unchecked-NULL alloc paths.
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
